{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "LAYER_0_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_0_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "LAYER_0", "class_name": "Conv2D", "config": {"name": "LAYER_0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [11, 11], "strides": [4, 4], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_0_pad", 0, 0, {}]]]}, {"name": "LAYER_1", "class_name": "Activation", "config": {"name": "LAYER_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_0", 0, 0, {}]]]}, {"name": "LAYER_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_2_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_1", 0, 0, {}]]]}, {"name": "LAYER_2", "class_name": "MaxPooling2D", "config": {"name": "LAYER_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_2_pad", 0, 0, {}]]]}, {"name": "LAYER_3_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_3_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_2", 0, 0, {}]]]}, {"name": "LAYER_3", "class_name": "Conv2D", "config": {"name": "LAYER_3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_3_pad", 0, 0, {}]]]}, {"name": "LAYER_4", "class_name": "Activation", "config": {"name": "LAYER_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_3", 0, 0, {}]]]}, {"name": "LAYER_5_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_5_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_4", 0, 0, {}]]]}, {"name": "LAYER_5", "class_name": "MaxPooling2D", "config": {"name": "LAYER_5", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_5_pad", 0, 0, {}]]]}, {"name": "LAYER_6_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_6_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_5", 0, 0, {}]]]}, {"name": "LAYER_6", "class_name": "Conv2D", "config": {"name": "LAYER_6", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_6_pad", 0, 0, {}]]]}, {"name": "LAYER_7", "class_name": "Activation", "config": {"name": "LAYER_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_6", 0, 0, {}]]]}, {"name": "LAYER_8_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_8_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_7", 0, 0, {}]]]}, {"name": "LAYER_8", "class_name": "Conv2D", "config": {"name": "LAYER_8", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_8_pad", 0, 0, {}]]]}, {"name": "LAYER_9", "class_name": "Activation", "config": {"name": "LAYER_9", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_8", 0, 0, {}]]]}, {"name": "LAYER_10_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_10_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_9", 0, 0, {}]]]}, {"name": "LAYER_10", "class_name": "Conv2D", "config": {"name": "LAYER_10", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_10_pad", 0, 0, {}]]]}, {"name": "LAYER_11", "class_name": "Activation", "config": {"name": "LAYER_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_10", 0, 0, {}]]]}, {"name": "LAYER_12_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_12_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_11", 0, 0, {}]]]}, {"name": "LAYER_12", "class_name": "MaxPooling2D", "config": {"name": "LAYER_12", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_12_pad", 0, 0, {}]]]}, {"name": "LAYER_13", "class_name": "AveragePooling2D", "config": {"name": "LAYER_13", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "valid", "strides": [1, 1], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_12", 0, 0, {}]]]}, {"name": "LAYER_14", "class_name": "Reshape", "config": {"name": "LAYER_14", "trainable": true, "dtype": "float32", "target_shape": [-1, 9216]}, "inbound_nodes": [[["LAYER_13", 0, 0, {}]]]}, {"name": "LAYER_15", "class_name": "Dense", "config": {"name": "LAYER_15", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_14", 0, 0, {}]]]}, {"name": "LAYER_16", "class_name": "Activation", "config": {"name": "LAYER_16", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_15", 0, 0, {}]]]}, {"name": "LAYER_17", "class_name": "Dense", "config": {"name": "LAYER_17", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_16", 0, 0, {}]]]}, {"name": "LAYER_18", "class_name": "Activation", "config": {"name": "LAYER_18", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["LAYER_17", 0, 0, {}]]]}, {"name": "LAYER_19", "class_name": "Dense", "config": {"name": "LAYER_19", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_18", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["LAYER_19", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "LAYER_0/kernel", "shape": [11, 11, 3, 64], "dtype": "float32", "quantization": {"min": -0.7962986534717037, "scale": 0.006864643564411238, "dtype": "uint8"}}, {"name": "LAYER_0/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -2.846740266388538, "scale": 0.015471414491242053, "dtype": "uint8"}}, {"name": "LAYER_10/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.2298967173870872, "scale": 0.0018690790031470504, "dtype": "uint8"}}, {"name": "LAYER_10/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.45199578158995685, "scale": 0.010761804323570401, "dtype": "uint8"}}, {"name": "LAYER_15/kernel", "shape": [9216, 4096], "dtype": "float32", "quantization": {"min": -0.07074751059214274, "scale": 0.0005202022837657555, "dtype": "uint8"}}, {"name": "LAYER_15/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.07261156334596522, "scale": 0.0006483175298746894, "dtype": "uint8"}}, {"name": "LAYER_17/kernel", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.10529100184931475, "scale": 0.0007574892219375162, "dtype": "uint8"}}, {"name": "LAYER_17/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.05141262236763449, "scale": 0.0009180825422791873, "dtype": "uint8"}}, {"name": "LAYER_19/kernel", "shape": [4096, 10], "dtype": "float32", "quantization": {"min": -0.28527556517544916, "scale": 0.002570050136715758, "dtype": "uint8"}}, {"name": "LAYER_19/bias", "shape": [10], "dtype": "float32", "quantization": {"min": -0.0965534673017614, "scale": 0.0011098099689857632, "dtype": "uint8"}}, {"name": "LAYER_3/kernel", "shape": [5, 5, 64, 192], "dtype": "float32", "quantization": {"min": -0.8956019177156336, "scale": 0.012438915523828245, "dtype": "uint8"}}, {"name": "LAYER_3/bias", "shape": [192], "dtype": "float32", "quantization": {"min": -0.5129186303007837, "scale": 0.004136440566941803, "dtype": "uint8"}}, {"name": "LAYER_6/kernel", "shape": [3, 3, 192, 384], "dtype": "float32", "quantization": {"min": -0.7250699767879412, "scale": 0.006416548467149921, "dtype": "uint8"}}, {"name": "LAYER_6/bias", "shape": [384], "dtype": "float32", "quantization": {"min": -0.4284062167008718, "scale": 0.003930332263310751, "dtype": "uint8"}}, {"name": "LAYER_8/kernel", "shape": [3, 3, 384, 256], "dtype": "float32", "quantization": {"min": -0.330954239765803, "scale": 0.002781128065258849, "dtype": "uint8"}}, {"name": "LAYER_8/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -1.4271830390481388, "scale": 0.008919893994050868, "dtype": "uint8"}}]}]}