{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.8", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "LAYER_0_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_0_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "LAYER_0", "class_name": "Conv2D", "config": {"name": "LAYER_0", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_0_pad", 0, 0, {}]]]}, {"name": "LAYER_1", "class_name": "BatchNormalization", "config": {"name": "LAYER_1", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_0", 0, 0, {}]]]}, {"name": "LAYER_2", "class_name": "ReLU", "config": {"name": "LAYER_2", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_1", 0, 0, {}]]]}, {"name": "LAYER_3_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_3_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_2", 0, 0, {}]]]}, {"name": "LAYER_3", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_3_pad", 0, 0, {}]]]}, {"name": "LAYER_4", "class_name": "BatchNormalization", "config": {"name": "LAYER_4", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_3", 0, 0, {}]]]}, {"name": "LAYER_5", "class_name": "ReLU", "config": {"name": "LAYER_5", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_4", 0, 0, {}]]]}, {"name": "LAYER_6", "class_name": "Conv2D", "config": {"name": "LAYER_6", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_5", 0, 0, {}]]]}, {"name": "LAYER_7", "class_name": "BatchNormalization", "config": {"name": "LAYER_7", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_6", 0, 0, {}]]]}, {"name": "LAYER_8", "class_name": "Conv2D", "config": {"name": "LAYER_8", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_7", 0, 0, {}]]]}, {"name": "LAYER_9", "class_name": "BatchNormalization", "config": {"name": "LAYER_9", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_8", 0, 0, {}]]]}, {"name": "LAYER_10", "class_name": "ReLU", "config": {"name": "LAYER_10", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_9", 0, 0, {}]]]}, {"name": "LAYER_11_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_11_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_10", 0, 0, {}]]]}, {"name": "LAYER_11", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_11", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_11_pad", 0, 0, {}]]]}, {"name": "LAYER_12", "class_name": "BatchNormalization", "config": {"name": "LAYER_12", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_11", 0, 0, {}]]]}, {"name": "LAYER_13", "class_name": "ReLU", "config": {"name": "LAYER_13", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_12", 0, 0, {}]]]}, {"name": "LAYER_14", "class_name": "Conv2D", "config": {"name": "LAYER_14", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_13", 0, 0, {}]]]}, {"name": "LAYER_15", "class_name": "BatchNormalization", "config": {"name": "LAYER_15", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_14", 0, 0, {}]]]}, {"name": "LAYER_16", "class_name": "Conv2D", "config": {"name": "LAYER_16", "trainable": true, "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_15", 0, 0, {}]]]}, {"name": "LAYER_17", "class_name": "BatchNormalization", "config": {"name": "LAYER_17", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_16", 0, 0, {}]]]}, {"name": "LAYER_18", "class_name": "ReLU", "config": {"name": "LAYER_18", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_17", 0, 0, {}]]]}, {"name": "LAYER_19_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_19_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_18", 0, 0, {}]]]}, {"name": "LAYER_19", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_19", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_19_pad", 0, 0, {}]]]}, {"name": "LAYER_20", "class_name": "BatchNormalization", "config": {"name": "LAYER_20", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_19", 0, 0, {}]]]}, {"name": "LAYER_21", "class_name": "ReLU", "config": {"name": "LAYER_21", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_20", 0, 0, {}]]]}, {"name": "LAYER_22", "class_name": "Conv2D", "config": {"name": "LAYER_22", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_21", 0, 0, {}]]]}, {"name": "LAYER_23", "class_name": "BatchNormalization", "config": {"name": "LAYER_23", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_22", 0, 0, {}]]]}, {"name": "LAYER_24", "class_name": "Add", "config": {"name": "LAYER_24", "trainable": true}, "inbound_nodes": [[["LAYER_15", 0, 0, {}], ["LAYER_23", 0, 0, {}]]]}, {"name": "LAYER_25", "class_name": "Conv2D", "config": {"name": "LAYER_25", "trainable": true, "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_24", 0, 0, {}]]]}, {"name": "LAYER_26", "class_name": "BatchNormalization", "config": {"name": "LAYER_26", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_25", 0, 0, {}]]]}, {"name": "LAYER_27", "class_name": "ReLU", "config": {"name": "LAYER_27", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_26", 0, 0, {}]]]}, {"name": "LAYER_28_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_28_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_27", 0, 0, {}]]]}, {"name": "LAYER_28", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_28", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_28_pad", 0, 0, {}]]]}, {"name": "LAYER_29", "class_name": "BatchNormalization", "config": {"name": "LAYER_29", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_28", 0, 0, {}]]]}, {"name": "LAYER_30", "class_name": "ReLU", "config": {"name": "LAYER_30", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_29", 0, 0, {}]]]}, {"name": "LAYER_31", "class_name": "Conv2D", "config": {"name": "LAYER_31", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_30", 0, 0, {}]]]}, {"name": "LAYER_32", "class_name": "BatchNormalization", "config": {"name": "LAYER_32", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_31", 0, 0, {}]]]}, {"name": "LAYER_33", "class_name": "Conv2D", "config": {"name": "LAYER_33", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_32", 0, 0, {}]]]}, {"name": "LAYER_34", "class_name": "BatchNormalization", "config": {"name": "LAYER_34", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_33", 0, 0, {}]]]}, {"name": "LAYER_35", "class_name": "ReLU", "config": {"name": "LAYER_35", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_34", 0, 0, {}]]]}, {"name": "LAYER_36_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_36_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_35", 0, 0, {}]]]}, {"name": "LAYER_36", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_36", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_36_pad", 0, 0, {}]]]}, {"name": "LAYER_37", "class_name": "BatchNormalization", "config": {"name": "LAYER_37", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_36", 0, 0, {}]]]}, {"name": "LAYER_38", "class_name": "ReLU", "config": {"name": "LAYER_38", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_37", 0, 0, {}]]]}, {"name": "LAYER_39", "class_name": "Conv2D", "config": {"name": "LAYER_39", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_38", 0, 0, {}]]]}, {"name": "LAYER_40", "class_name": "BatchNormalization", "config": {"name": "LAYER_40", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_39", 0, 0, {}]]]}, {"name": "LAYER_41", "class_name": "Add", "config": {"name": "LAYER_41", "trainable": true}, "inbound_nodes": [[["LAYER_32", 0, 0, {}], ["LAYER_40", 0, 0, {}]]]}, {"name": "LAYER_42", "class_name": "Conv2D", "config": {"name": "LAYER_42", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_41", 0, 0, {}]]]}, {"name": "LAYER_43", "class_name": "BatchNormalization", "config": {"name": "LAYER_43", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_42", 0, 0, {}]]]}, {"name": "LAYER_44", "class_name": "ReLU", "config": {"name": "LAYER_44", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_43", 0, 0, {}]]]}, {"name": "LAYER_45_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_45_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_44", 0, 0, {}]]]}, {"name": "LAYER_45", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_45", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_45_pad", 0, 0, {}]]]}, {"name": "LAYER_46", "class_name": "BatchNormalization", "config": {"name": "LAYER_46", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_45", 0, 0, {}]]]}, {"name": "LAYER_47", "class_name": "ReLU", "config": {"name": "LAYER_47", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_46", 0, 0, {}]]]}, {"name": "LAYER_48", "class_name": "Conv2D", "config": {"name": "LAYER_48", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_47", 0, 0, {}]]]}, {"name": "LAYER_49", "class_name": "BatchNormalization", "config": {"name": "LAYER_49", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_48", 0, 0, {}]]]}, {"name": "LAYER_50", "class_name": "Add", "config": {"name": "LAYER_50", "trainable": true}, "inbound_nodes": [[["LAYER_41", 0, 0, {}], ["LAYER_49", 0, 0, {}]]]}, {"name": "LAYER_51", "class_name": "Conv2D", "config": {"name": "LAYER_51", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_50", 0, 0, {}]]]}, {"name": "LAYER_52", "class_name": "BatchNormalization", "config": {"name": "LAYER_52", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_51", 0, 0, {}]]]}, {"name": "LAYER_53", "class_name": "ReLU", "config": {"name": "LAYER_53", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_52", 0, 0, {}]]]}, {"name": "LAYER_54_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_54_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_53", 0, 0, {}]]]}, {"name": "LAYER_54", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_54", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_54_pad", 0, 0, {}]]]}, {"name": "LAYER_55", "class_name": "BatchNormalization", "config": {"name": "LAYER_55", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_54", 0, 0, {}]]]}, {"name": "LAYER_56", "class_name": "ReLU", "config": {"name": "LAYER_56", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_55", 0, 0, {}]]]}, {"name": "LAYER_57", "class_name": "Conv2D", "config": {"name": "LAYER_57", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_56", 0, 0, {}]]]}, {"name": "LAYER_58", "class_name": "BatchNormalization", "config": {"name": "LAYER_58", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_57", 0, 0, {}]]]}, {"name": "LAYER_59", "class_name": "Conv2D", "config": {"name": "LAYER_59", "trainable": true, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_58", 0, 0, {}]]]}, {"name": "LAYER_60", "class_name": "BatchNormalization", "config": {"name": "LAYER_60", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_59", 0, 0, {}]]]}, {"name": "LAYER_61", "class_name": "ReLU", "config": {"name": "LAYER_61", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_60", 0, 0, {}]]]}, {"name": "LAYER_62_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_62_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_61", 0, 0, {}]]]}, {"name": "LAYER_62", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_62", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_62_pad", 0, 0, {}]]]}, {"name": "LAYER_63", "class_name": "BatchNormalization", "config": {"name": "LAYER_63", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_62", 0, 0, {}]]]}, {"name": "LAYER_64", "class_name": "ReLU", "config": {"name": "LAYER_64", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_63", 0, 0, {}]]]}, {"name": "LAYER_65", "class_name": "Conv2D", "config": {"name": "LAYER_65", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_64", 0, 0, {}]]]}, {"name": "LAYER_66", "class_name": "BatchNormalization", "config": {"name": "LAYER_66", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_65", 0, 0, {}]]]}, {"name": "LAYER_67", "class_name": "Add", "config": {"name": "LAYER_67", "trainable": true}, "inbound_nodes": [[["LAYER_58", 0, 0, {}], ["LAYER_66", 0, 0, {}]]]}, {"name": "LAYER_68", "class_name": "Conv2D", "config": {"name": "LAYER_68", "trainable": true, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_67", 0, 0, {}]]]}, {"name": "LAYER_69", "class_name": "BatchNormalization", "config": {"name": "LAYER_69", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_68", 0, 0, {}]]]}, {"name": "LAYER_70", "class_name": "ReLU", "config": {"name": "LAYER_70", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_69", 0, 0, {}]]]}, {"name": "LAYER_71_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_71_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_70", 0, 0, {}]]]}, {"name": "LAYER_71", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_71", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_71_pad", 0, 0, {}]]]}, {"name": "LAYER_72", "class_name": "BatchNormalization", "config": {"name": "LAYER_72", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_71", 0, 0, {}]]]}, {"name": "LAYER_73", "class_name": "ReLU", "config": {"name": "LAYER_73", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_72", 0, 0, {}]]]}, {"name": "LAYER_74", "class_name": "Conv2D", "config": {"name": "LAYER_74", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_73", 0, 0, {}]]]}, {"name": "LAYER_75", "class_name": "BatchNormalization", "config": {"name": "LAYER_75", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_74", 0, 0, {}]]]}, {"name": "LAYER_76", "class_name": "Add", "config": {"name": "LAYER_76", "trainable": true}, "inbound_nodes": [[["LAYER_67", 0, 0, {}], ["LAYER_75", 0, 0, {}]]]}, {"name": "LAYER_77", "class_name": "Conv2D", "config": {"name": "LAYER_77", "trainable": true, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_76", 0, 0, {}]]]}, {"name": "LAYER_78", "class_name": "BatchNormalization", "config": {"name": "LAYER_78", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_77", 0, 0, {}]]]}, {"name": "LAYER_79", "class_name": "ReLU", "config": {"name": "LAYER_79", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_78", 0, 0, {}]]]}, {"name": "LAYER_80_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_80_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_79", 0, 0, {}]]]}, {"name": "LAYER_80", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_80", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_80_pad", 0, 0, {}]]]}, {"name": "LAYER_81", "class_name": "BatchNormalization", "config": {"name": "LAYER_81", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_80", 0, 0, {}]]]}, {"name": "LAYER_82", "class_name": "ReLU", "config": {"name": "LAYER_82", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_81", 0, 0, {}]]]}, {"name": "LAYER_83", "class_name": "Conv2D", "config": {"name": "LAYER_83", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_82", 0, 0, {}]]]}, {"name": "LAYER_84", "class_name": "BatchNormalization", "config": {"name": "LAYER_84", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_83", 0, 0, {}]]]}, {"name": "LAYER_85", "class_name": "Add", "config": {"name": "LAYER_85", "trainable": true}, "inbound_nodes": [[["LAYER_76", 0, 0, {}], ["LAYER_84", 0, 0, {}]]]}, {"name": "LAYER_86", "class_name": "Conv2D", "config": {"name": "LAYER_86", "trainable": true, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_85", 0, 0, {}]]]}, {"name": "LAYER_87", "class_name": "BatchNormalization", "config": {"name": "LAYER_87", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_86", 0, 0, {}]]]}, {"name": "LAYER_88", "class_name": "ReLU", "config": {"name": "LAYER_88", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_87", 0, 0, {}]]]}, {"name": "LAYER_89_pad", "class_name": "ZeroPadding2D", "config": {"name": "LAYER_89_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["LAYER_88", 0, 0, {}]]]}, {"name": "LAYER_89", "class_name": "DepthwiseConv2D", "config": {"name": "LAYER_89", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["LAYER_89_pad", 0, 0, {}]]]}, {"name": "LAYER_90", "class_name": "BatchNormalization", "config": {"name": "LAYER_90", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_89", 0, 0, {}]]]}, {"name": "LAYER_91", "class_name": "ReLU", "config": {"name": "LAYER_91", "trainable": true, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["LAYER_90", 0, 0, {}]]]}, {"name": "LAYER_92", "class_name": "Conv2D", "config": {"name": "LAYER_92", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_91", 0, 0, {}]]]}, {"name": "LAYER_93", "class_name": "BatchNormalization", "config": {"name": "LAYER_93", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["LAYER_92", 0, 0, {}]]]}, {"name": "LAYER_94", "class_name": "Conv2D", "config": {"name": "LAYER_94", "trainable": true, "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LAYER_93", 0, 0, {}]]]}, {"name": "LAYER_95", "class_name": "BatchNormalization", "config": {"name": "LAYER_95", "trainable": true, "axis": 1, "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, 